Spoke: smss-iBase-backup, Environment: prod and Pipeline Stage: Prod
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_backup_policy_vm.policy["daily-backup-policy-1"] will be created
  + resource "azurerm_backup_policy_vm" "policy" {
      + id                             = (known after apply)
      + instant_restore_retention_days = (known after apply)
      + name                           = "daily-backup-policy-1"
      + policy_type                    = "V2"
      + recovery_vault_name            = "rsv-smss-core-001"
      + resource_group_name            = "rg-smss-core-001"
      + timezone                       = "UTC"

      + backup {
          + frequency = "Daily"
          + time      = "20:00"
        }

      + retention_daily {
          + count = 14
        }
    }

  # azurerm_backup_policy_vm_workload.backup_workload_policies["ibasesqlbackup01"] will be created
  + resource "azurerm_backup_policy_vm_workload" "backup_workload_policies" {
      + id                  = (known after apply)
      + name                = "ibasesqlbackup01"
      + recovery_vault_name = "rsv-smss-core-001"
      + resource_group_name = "rg-smss-core-001"
      + workload_type       = "SQLDataBase"

      + protection_policy {
          + policy_type = "Log"

          + backup {
              + frequency_in_minutes = 15
              + weekdays             = []
            }

          + simple_retention {
              + count = 8
            }
        }
      + protection_policy {
          + policy_type = "Full"

          + backup {
              + frequency = "Daily"
              + time      = "22:00"
              + weekdays  = []
            }

          + retention_daily {
              + count = 8
            }
        }

      + settings {
          + compression_enabled = false
          + time_zone           = "UTC"
        }
    }

  # azurerm_backup_protected_vm.vm["vm-ibase-sql1"] will be created
  + resource "azurerm_backup_protected_vm" "vm" {
      + backup_policy_id    = (known after apply)
      + id                  = (known after apply)
      + protection_state    = (known after apply)
      + recovery_vault_name = "rsv-smss-core-001"
      + resource_group_name = "rg-smss-core-001"
      + source_vm_id        = "/subscriptions/becc4bf3-5028-43e4-8008-06e9362d6b86/resourceGroups/RG-SMSS-IBASE-001/providers/Microsoft.Compute/virtualMachines/vm-ibase-sql1"
    }

  # azurerm_backup_protected_vm.vm["vm-ibase-win1"] will be created
  + resource "azurerm_backup_protected_vm" "vm" {
      + backup_policy_id    = (known after apply)
      + id                  = (known after apply)
      + protection_state    = (known after apply)
      + recovery_vault_name = "rsv-smss-core-001"
      + resource_group_name = "rg-smss-core-001"
      + source_vm_id        = "/subscriptions/becc4bf3-5028-43e4-8008-06e9362d6b86/resourceGroups/RG-SMSS-IBASE-001/providers/Microsoft.Compute/virtualMachines/vm-ibase-win1"
    }

  # azurerm_backup_protected_vm.vm-sql["vm-ibase-sql1"] will be created
  + resource "azurerm_backup_protected_vm" "vm-sql" {
      + backup_policy_id    = (known after apply)
      + id                  = (known after apply)
      + protection_state    = (known after apply)
      + recovery_vault_name = "rsv-smss-core-001"
      + resource_group_name = "rg-smss-core-001"
      + source_vm_id        = "/subscriptions/becc4bf3-5028-43e4-8008-06e9362d6b86/resourceGroups/RG-SMSS-IBASE-001/providers/Microsoft.Compute/virtualMachines/vm-ibase-sql1"
    }

Plan: 5 to add, 0 to change, 0 to destroy.